a = [float(x) for x in input().split()] #บรรทัดนี้เป็นการรับค่าหลายค่าเก็บไว้ในตัวแปรaซึ่งเป็นประเภทlist
max = a[0] #กำหนดค่าตัวแปรmaxให้เท่ากับตำแหน่งที่0ของlist a 
min = a[1] #กำหนดค่าตัวแปรminให้เท่ากับตำแหน่งที่1ของlist a 
for i in range(len(a)):  #เป็นลูปที่จะทำงานตามจำนวนค่าที่อยู่ในlist a
    if a[i] > max: #เป็นเงื่อนไข ถ้า ตำแหน่งที่iของlist a มีค่ามากกว่าค่าmax เป็นจริง  จะทำคำสั่ง
        max=a[i] #กำหนดค่าตัวแปรmaxเท่ากับค่าตำแหน่งที่iของlist a
    elif a[i] < min:  #เป็นเงื่อนไข ถ้า ตำแหน่งที่iของlist a มีค่าน้อยกว่าค่าmin เป็นจริง
        min=a[i] #กำหนดค่าตัวแปรminค่าตำแหน่งที่iของlist a
print(f"min : {min}") #เอาท์พุตค่าของตัวแปรmin
print(f"max : {max}") #เอาท์พุตค่าของตัวแปรmax

